garyPenhook/PyAvrOCD/svd/avr32du20.svd
        <register>
          <name>PITEVGENCTRLA</name>
          <description>PIT Event Generation Control A</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVGEN0SEL</name>
              <description>Event Generation 0 Select</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_RTC divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_RTC divided by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_RTC divided by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_RTC divided by 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_RTC divided by 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_RTC divided by 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_RTC divided by 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>CLK_RTC divided by 512</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>CLK_RTC divided by 1024</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2048</name>
                  <description>CLK_RTC divided by 2048</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4096</name>
                  <description>CLK_RTC divided by 4096</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8192</name>
                  <description>CLK_RTC divided by 8192</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16384</name>
                  <description>CLK_RTC divided by 16384</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>CLK_RTC divided by 32768</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVGEN1SEL</name>
              <description>Event Generation 1 Select</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_RTC divided by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_RTC divided by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_RTC divided by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_RTC divided by 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_RTC divided by 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_RTC divided by 128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_RTC divided by 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>CLK_RTC divided by 512</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>CLK_RTC divided by 1024</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2048</name>
                  <description>CLK_RTC divided by 2048</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4096</name>
                  <description>CLK_RTC divided by 4096</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8192</name>
                  <description>CLK_RTC divided by 8192</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16384</name>
                  <description>CLK_RTC divided by 16384</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>CLK_RTC divided by 32768</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PITINTCTRL</name>
          <description>PIT Interrupt Control</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PI</name>
              <description>Periodic Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PITINTFLAGS</name>
          <description>PIT Interrupt Flags</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PI</name>
              <description>Periodic Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PITSTATUS</name>
          <description>PIT Status</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTRLBUSY</name>
              <description>CTRLA Synchronization Busy Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTRLABUSY</name>
              <description>CTRLA Synchronization Busy Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CNTBUSY</name>
              <description>Count Synchronization Busy Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PERBUSY</name>
              <description>Period Synchronization Busy Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPBUSY</name>
              <description>Comparator Synchronization Busy Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
